
===========================================================================
report_tns
============================================================================
tns -15.25

===========================================================================
report_wns
============================================================================
wns -2.58

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -2.58

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.13
