###############################################################################
# Created by write_sdc
# Sat Nov 25 14:54:12 2023
###############################################################################
current_design openlane_manchester_baby
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clock -period 10.0000 [get_ports {clock}]
set_clock_transition 0.1500 [get_clocks {clock}]
set_clock_uncertainty 0.2500 clock
set_propagated_clock [get_clocks {clock}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[0]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[10]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[11]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[12]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[13]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[14]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[15]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[16]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[17]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[18]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[19]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[1]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[20]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[21]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[22]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[23]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[24]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[25]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[26]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[27]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[28]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[29]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[2]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[30]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[31]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[3]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[4]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[5]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[6]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[7]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[8]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[9]}]
set_input_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {reset_i}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {logisim_clock_tree_0_out}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_addr_o[0]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_addr_o[1]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_addr_o[2]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_addr_o[3]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_addr_o[4]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[0]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[10]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[11]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[12]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[13]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[14]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[15]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[16]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[17]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[18]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[19]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[1]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[20]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[21]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[22]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[23]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[24]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[25]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[26]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[27]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[28]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[29]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[2]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[30]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[31]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[3]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[4]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[5]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[6]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[7]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[8]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_data_io[9]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {ram_rw_en_o}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -add_delay [get_ports {stop_lamp_o}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {logisim_clock_tree_0_out}]
set_load -pin_load 0.0334 [get_ports {ram_rw_en_o}]
set_load -pin_load 0.0334 [get_ports {stop_lamp_o}]
set_load -pin_load 0.0334 [get_ports {ram_addr_o[4]}]
set_load -pin_load 0.0334 [get_ports {ram_addr_o[3]}]
set_load -pin_load 0.0334 [get_ports {ram_addr_o[2]}]
set_load -pin_load 0.0334 [get_ports {ram_addr_o[1]}]
set_load -pin_load 0.0334 [get_ports {ram_addr_o[0]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[31]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[30]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[29]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[28]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[27]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[26]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[25]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[24]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[23]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[22]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[21]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[20]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[19]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[18]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[17]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[16]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[15]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[14]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[13]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[12]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[11]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[10]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[9]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[8]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[7]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[6]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[5]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[4]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[3]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[2]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[1]}]
set_load -pin_load 0.0334 [get_ports {ram_data_io[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ram_data_io[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
